app/views/debts/_form.html.erb

    <div class="controls">
      <%= f.collection_select :from, current_user.friends.order(:name),:name,:name, include_blank: false %>
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = 2 ORDER BY name