app/controllers/debts_controller.rb

  def find_user
    @user = current_user || User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

  def index

    @debts = Debt.where(:user_id => @user.id)
---
SELECT "debts".* FROM "debts" WHERE "debts"."user_id" = 2

  def show
    @debt = Debt.find(params[:id])
---
SELECT "debts".* FROM "debts" WHERE "debts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @debt = @user.debts.build(params[:debt])
    @debt.save
---
INSERT INTO "debts" ("amount", "authentication_id", "created_at", "deadline", "from", "to_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)