app/controllers/friends_controller.rb

  def index
    @friends = Friend.where(:user_id => @user.id)
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = 2

  def show
    @friend = Friend.find(params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @friend = Friend.find(params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", "789789"]]

  def create
    @friend = @user.friends.build(params[:friend])

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("created_at", "email", "name", "surname", "twitterUsername", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @friend = Friend.find(params[:id])

    respond_to do |format|
      if @friend.update_attributes(params[:friend])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", "789789"]]
UPDATE "friends" SET "name" = 'Updated friend', "updated_at" = '2013-12-30 16:06:41.715794' WHERE "friends"."id" = 789789

  def destroy
    @friend = Friend.find(params[:id])
    @friend.destroy
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT 1  [["id", "789789"]]
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 789789]]